In [1]:
import numpy as np
import pandas as pd

In [4]:
filas = ['ventas1', 'ventas2', 'ventas3']
columnas = ['zonaA', 'zonaB', 'zonaC']
datos = [[123,434,567], [566,534,572], [532,107,493]]

In [7]:
dataframe = pd.DataFrame(datos, filas, columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas2    566    534    572
ventas3    532    107    493

In [14]:
dataframe.loc[['ventas1','ventas2']]

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas2    566    534    572

In [19]:
dataframe['zonaA']

ventas1    123
ventas2    566
ventas3    532
Name: zonaA, dtype: int64

In [24]:
dataframe.loc['ventas1'] ['zonaB']

434

In [34]:
dataframe['VentasTotales'] = dataframe['zonaA'] + dataframe['zonaB'] + dataframe['zonaC']
dataframe

         zonaA  zonaB  zonaC  VentasTotales
ventas1    123    434    567           1124
ventas2    566    534    572           1672
ventas3    532    107    493           1132

In [36]:
dataframe.drop('VentasTotales', axis = 1)

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas2    566    534    572
ventas3    532    107    493

In [37]:
dataframe

         zonaA  zonaB  zonaC  VentasTotales
ventas1    123    434    567           1124
ventas2    566    534    572           1672
ventas3    532    107    493           1132

In [38]:
dataframe.drop('VentasTotales', axis = 1, inplace = True)

In [39]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas2    566    534    572
ventas3    532    107    493

In [40]:
dataframe.drop("ventas2")

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas3    532    107    493

In [41]:
dataframe.shape

(3, 3)

In [42]:
dataframe.drop("ventas2", inplace=True)
dataframe

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas3    532    107    493

In [43]:
dataframe.shape

(2, 3)

# DataFrames: Selección de datos con una condición

In [49]:
fila = 'ventas1 ventas2 ventas3'.split()
fila

['ventas1', 'ventas2', 'ventas3']

In [46]:
columna = 'zonaA zonaB zonaC'.split()
columna

['zonaA', 'zonaB', 'zonaC']

In [47]:
dato = [[165, 589, 645], [789,654,798], [398,878,145]]
dato

[[165, 589, 645], [789, 654, 798], [398, 878, 145]]

In [50]:
DF = pd.DataFrame(dato, fila, columna)
DF

         zonaA  zonaB  zonaC
ventas1    165    589    645
ventas2    789    654    798
ventas3    398    878    145

In [51]:
condicion = DF > 200

In [53]:
DF[condicion]

         zonaA  zonaB  zonaC
ventas1    NaN    589  645.0
ventas2  789.0    654  798.0
ventas3  398.0    878    NaN

In [54]:
condicion1 = DF['zonaA'] > 200
DF[condicion1]

         zonaA  zonaB  zonaC
ventas2    789    654    798
ventas3    398    878    145

In [60]:
condicion2 = (DF['zonaA'] > 200) & (DF['zonaB'] > 50)
DF[condicion2]

         zonaA  zonaB  zonaC
ventas2    789    654    798
ventas3    398    878    145

In [61]:
condicion3 = (DF['zonaA'] > 200) | (DF['zonaB'] > 50)
DF[condicion3]

         zonaA  zonaB  zonaC
ventas1    165    589    645
ventas2    789    654    798
ventas3    398    878    145

## DataFrames: Modificación de los nombres de las filas

In [62]:
Ventas = 'venta1 venta2 venta2'.split()
Zonas = 'zonaA zonaB zonaC'.split()
Valores = [[100,200,450], [158,159,658], [314,589,146]]
DFV = pd.DataFrame(Valores, Ventas, Zonas)
DFV

        zonaA  zonaB  zonaC
venta1    100    200    450
venta2    158    159    658
venta2    314    589    146

In [63]:
NuevasVentas = 'dia1 dia2 dia3'.split()
NuevasVentas

['dia1', 'dia2', 'dia3']

In [64]:
DFV['dias'] = NuevasVentas
DFV

        zonaA  zonaB  zonaC  dias
venta1    100    200    450  dia1
venta2    158    159    658  dia2
venta2    314    589    146  dia3

In [67]:
DFV = DFV.set_index('dias')
DFV

      zonaA  zonaB  zonaC
dias
dia1    100    200    450
dia2    158    159    658
dia3    314    589    146

## Pandas: Tratamiento de valores nulos o sin valor

In [68]:
diccionario = {'A':[4,5,np.nan], 'B':[6,4,2], 'C':[np.nan, 4, np.nan]}

In [69]:
DFN = pd.DataFrame(diccionario)
DFN

     A  B    C
0  4.0  6  NaN
1  5.0  4  4.0
2  NaN  2  NaN

In [70]:
DFN.dropna()

     A  B    C
1  5.0  4  4.0

In [72]:
DFN.dropna(axis=1)

   B
0  6
1  4
2  2

In [73]:
DFN

     A  B    C
0  4.0  6  NaN
1  5.0  4  4.0
2  NaN  2  NaN

In [74]:
DFN.fillna(value=150)

       A  B      C
0    4.0  6  150.0
1    5.0  4    4.0
2  150.0  2  150.0

In [75]:
valor_medio = DFN.mean()
valor_medio

A    4.5
B    4.0
C    4.0
dtype: float64

In [76]:
DFN.fillna(value=valor_medio)

     A  B    C
0  4.0  6  4.0
1  5.0  4  4.0
2  4.5  2  4.0